12/data/attachments/b89fd576517b7e0c.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Greg_energy_Actions_64802_1</nif:username>
            <nif:friendToBeRequested>soap_actions_96faaca7-9f55-4475-aa2f-a65f87d7b536</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>